package com.javarush.task.task03.task0305;

/*Вывести на экран дату своего рождения в виде:
MAY 1 2012
*/
public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int day = 21;
        String month = "OCTOBER";
        int year = 1970;
        System.out.println(month + " " + day + " " + year);
    }
}