package com.javarush.task.task04.task0430;

/*Вывести на экран числа от 1 до 10 используя цикл while. Каждое значение с новой строки.*/
public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int x = 1;
        while (x < 11) {
            System.out.println(x);
            x++;
        }
    }
}