package com.javarush.task.task04.task0431;

/*Вывести на экран числа от 10 до 1 используя цикл while. Каждое значение
с новой строки.*/
public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int x = 10;
        while (x > 0) {
            System.out.println(x);
            x--;
        }
    }
}